Filen med data for butikker er i formattet json. 

Dataen kan hentes igennem en pandas dataframe. 

Pandas bibliotekket importes.

```
import pandas as pd
```


Dataen hentes ved af:

```
data=pd.read_json(url)
```

In [44]:
import pandas as pd
data=pd.read_json("https://platform-rest-prod.ngdata.no/api/FindStore/StoresClosestToMe/1300/?latitude=65.4&longitude=16.8&minnumberofstores=200&maxNumberOfStores=300&maxDistance=2470554")

Dataen er nestet i parameteren "store" med navn


```
data.store
```

Vis data

In [45]:
data

     distance                                              store
0           1  {'id': 7080001209629, 'chainid': 1300, 'name':...
1           1  {'id': 7080001022945, 'chainid': 1300, 'name':...
2           1  {'id': 7080000003242, 'chainid': 1300, 'name':...
3           1  {'id': 7080000954704, 'chainid': 1300, 'name':...
4           1  {'id': 7080000954674, 'chainid': 1300, 'name':...
..        ...                                                ...
174         1  {'id': 7080000062881, 'chainid': 1300, 'name':...
175         1  {'id': 7080000748273, 'chainid': 1300, 'name':...
176         1  {'id': 7080001007157, 'chainid': 1300, 'name':...
177         1  {'id': 7080001409920, 'chainid': 1300, 'name':...
178         1  {'id': 7080001120832, 'chainid': 1300, 'name':...

[179 rows x 2 columns]

Ved at iterere igennem datasettet, kan dataen lagres som en pandas dataframe.

In [46]:
database=[]

for i, store in enumerate(data.store):

  database.append(store)
database=pd.DataFrame(database)
database.head(3)

              id  ...                                         suggestion
0  7080001209629  ...  [TRONDHEIM, TRØNDELAG, MENY Tiller, 7075, Tiller]
1  7080001022945  ...          [BÆRUM, VIKEN, MENY Kolsås, 1352, Kolsås]
2  7080000003242  ...            [OSLO, OSLO, MENY Grorud, 0963, Grorud]

[3 rows x 22 columns]



På nuværende tidspunkt er latitude og longitude formateret såledelse. F.eks
```
{'latitude': 58.4729125984, 'longitude': 8.814.}
```

In [37]:
database.head(3)

              id  ...                                         suggestion
0  7080001381936  ...  [FÆRDER, VESTFOLD OG TELEMARK, MENY Teie Torg,...
1  7080001134044  ...         [NITTEDAL, VIKEN, MENY Åneby, 1488, Åneby]
2  7080001107253  ...     [VERDAL, TRØNDELAG, MENY Verdal, 7650, Verdal]

[3 rows x 22 columns]



**Oppgave:**

Separere latitude og longitude i 2 separate kolonner ved navn "latitude" og "longitude", som vist i billedet

![image.png]()


Hints:

* Du kan bruge tidligere eksempel, som template.


Template:

```
database=[]
for i, store in enumerate(data.store):

  database.append(store)
database=pd.DataFrame(database)
database.head(3)
```